#### R-Data Frames- Basics

#### There are many data sets built in that ship with R environment. data() shows them the list of all the datasets available in R

In [1]:
data()

In [2]:
head(state.x77) # head function shows the data set top 6 rows

           Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Alabama     3615      3624   2.1        69.05    15.1   41.3     20    50708
Alaska       365      6315   1.5        69.31    11.3   66.7    152   566432
Arizona     2212      4530   1.8        70.55     7.8   58.1     15   113417
Arkansas    2110      3378   1.9        70.66    10.1   39.9     65    51945
California 21198      5114   1.1        71.71    10.3   62.6     20   156361
Colorado    2541      4884   0.7        72.06     6.8   63.9    166   103766

In [3]:
tail(state.x77) # tail function shows the last 6 rows

              Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Vermont        472       3907   0.6        71.64    5.5    57.1    168    9267
Virginia      4981       4701   1.4        70.08    9.5    47.8     85   39780
Washington    3559       4864   0.6        71.72    4.3    63.5     32   66570
West Virginia 1799       3617   1.4        69.48    6.7    41.6    100   24070
Wisconsin     4589       4468   0.7        72.48    3.0    54.5    149   54464
Wyoming        376       4566   0.6        70.29    6.9    62.9    173   97203

In [4]:
# check the type of the dataset
class(state.x77)

[1] "matrix"

In [5]:
df <- state.x77

In [6]:
# changing the matrix type to dataframe type
df <- data.frame(df)

In [7]:
class(df)

[1] "data.frame"

#### To explore the data frame

In [8]:
head(df,3)

        Population Income Illiteracy Life.Exp Murder HS.Grad Frost Area
Alabama 3615       3624   2.1        69.05    15.1   41.3     20    50708
Alaska   365       6315   1.5        69.31    11.3   66.7    152   566432
Arizona 2212       4530   1.8        70.55     7.8   58.1     15   113417

In [9]:
tail(df)

              Population Income Illiteracy Life.Exp Murder HS.Grad Frost Area
Vermont        472       3907   0.6        71.64    5.5    57.1    168    9267
Virginia      4981       4701   1.4        70.08    9.5    47.8     85   39780
Washington    3559       4864   0.6        71.72    4.3    63.5     32   66570
West Virginia 1799       3617   1.4        69.48    6.7    41.6    100   24070
Wisconsin     4589       4468   0.7        72.48    3.0    54.5    149   54464
Wyoming        376       4566   0.6        70.29    6.9    62.9    173   97203

In [10]:
# Summary of the data frame
summary(df)

   Population        Income       Illiteracy       Life.Exp
 Min.   :  365   Min.   :3098   Min.   :0.500   Min.   :67.96
 1st Qu.: 1080   1st Qu.:3993   1st Qu.:0.625   1st Qu.:70.12
 Median : 2838   Median :4519   Median :0.950   Median :70.67
 Mean   : 4246   Mean   :4436   Mean   :1.170   Mean   :70.88
 3rd Qu.: 4968   3rd Qu.:4814   3rd Qu.:1.575   3rd Qu.:71.89
 Max.   :21198   Max.   :6315   Max.   :2.800   Max.   :73.60
     Murder          HS.Grad          Frost             Area
 Min.   : 1.400   Min.   :37.80   Min.   :  0.00   Min.   :  1049
 1st Qu.: 4.350   1st Qu.:48.05   1st Qu.: 66.25   1st Qu.: 36985
 Median : 6.850   Median :53.25   Median :114.50   Median : 54277
 Mean   : 7.378   Mean   :53.11   Mean   :104.46   Mean   : 70736
 3rd Qu.:10.675   3rd Qu.:59.15   3rd Qu.:139.75   3rd Qu.: 81163
 Max.   :15.100   Max.   :67.30   Max.   :188.00   Max.   :566432

In [11]:
str(df)

'data.frame':	50 obs. of  8 variables:
 $ Population: num  3615 365 2212 2110 21198 ...
 $ Income    : num  3624 6315 4530 3378 5114 ...
 $ Illiteracy: num  2.1 1.5 1.8 1.9 1.1 0.7 1.1 0.9 1.3 2 ...
 $ Life.Exp  : num  69 69.3 70.5 70.7 71.7 ...
 $ Murder    : num  15.1 11.3 7.8 10.1 10.3 6.8 3.1 6.2 10.7 13.9 ...
 $ HS.Grad   : num  41.3 66.7 58.1 39.9 62.6 63.9 56 54.6 52.6 40.6 ...
 $ Frost     : num  20 152 15 65 20 166 139 103 11 60 ...
 $ Area      : num  50708 566432 113417 51945 156361 ...

#### dim() -- Size rows, cols

In [12]:
# Size of the dataframe rows, columns
print(dim(df))

[1] 50  8

#### column Names

In [13]:
names(df)

[1] "Population" "Income"     "Illiteracy" "Life.Exp"   "Murder"
[6] "HS.Grad"    "Frost"      "Area"

In [14]:
colnames(df)

[1] "Population" "Income"     "Illiteracy" "Life.Exp"   "Murder"
[6] "HS.Grad"    "Frost"      "Area"

#### Row names

In [16]:
rownames(df)

 [1] "Alabama"        "Alaska"         "Arizona"        "Arkansas"
 [5] "California"     "Colorado"       "Connecticut"    "Delaware"
 [9] "Florida"        "Georgia"        "Hawaii"         "Idaho"
[13] "Illinois"       "Indiana"        "Iowa"           "Kansas"
[17] "Kentucky"       "Louisiana"      "Maine"          "Maryland"
[21] "Massachusetts"  "Michigan"       "Minnesota"      "Mississippi"
[25] "Missouri"       "Montana"        "Nebraska"       "Nevada"
[29] "New Hampshire"  "New Jersey"     "New Mexico"     "New York"
[33] "North Carolina" "North Dakota"   "Ohio"           "Oklahoma"
[37] "Oregon"         "Pennsylvania"   "Rhode Island"   "South Carolina"
[41] "South Dakota"   "Tennessee"      "Texas"          "Utah"
[45] "Vermont"        "Virginia"       "Washington"     "West Virginia"
[49] "Wisconsin"      "Wyoming"

#### Number of rows

In [17]:
nrow(df)

[1] 50

#### Number of cols

In [18]:
ncol(df)

[1] 8

#### Data-Frames Indexing and selecting the contents

In [19]:
# Let us make a dataframe from vectors
Names <- c('Raju', 'Latha', 'Madhavi', 'Sita', 'Kapoor', 'John', 'Mary', 'Abdul', 'Razak', 'Sree')
Ages <- c(24,32,26, 28, 29,18,30,28,19,35)
Gender <- c('M','F','F','F','M','M','F','M','M','M')

In [20]:
# Make One column Dataframe 
Friends <- data.frame(Names)

In [21]:
# Bind columns to this 
Friends <- cbind(Friends,Ages)
Friends <- cbind(Friends, Gender)

In [22]:
Friends

   Names   Ages Gender
1  Raju    24   M
2  Latha   32   F
3  Madhavi 26   F
4  Sita    28   F
5  Kapoor  29   M
6  John    18   M
7  Mary    30   F
8  Abdul   28   M
9  Razak   19   M
10 Sree    35   M

#### Rows selection

In [23]:
#select rows starting from 2nd row to 5th row
Friends[2:5,]

  Names   Ages Gender
2 Latha   32   F
3 Madhavi 26   F
4 Sita    28   F
5 Kapoor  29   M

In [24]:
# Select a single row 5th one
Friends[5:5,]

  Names  Ages Gender
5 Kapoor 29   M

#### Columns selection

In [25]:
# Selecting Columns 2 and 3
Friends[,2:3]

   Ages Gender
1  24   M
2  32   F
3  26   F
4  28   F
5  29   M
6  18   M
7  30   F
8  28   M
9  19   M
10 35   M

In [26]:
#selecting column 2 only
Friends[,2:2]

 [1] 24 32 26 28 29 18 30 28 19 35

#### Selecting block of data

In [27]:
# Select block sita, age, kapoor , age
Friends[4:5, 1:2]

  Names  Ages
4 Sita   28
5 Kapoor 29

#### Logical selection with subset

In [28]:
# get all females candidates
subset(Friends, Gender == 'F')

  Names   Ages Gender
2 Latha   32   F
3 Madhavi 26   F
4 Sita    28   F
7 Mary    30   F

In [29]:
# get all candidates where the age is more than 20 and less than 30
subset(Friends, (Ages > 20 & Ages <30 ))

  Names   Ages Gender
1 Raju    24   M
3 Madhavi 26   F
4 Sita    28   F
5 Kapoor  29   M
8 Abdul   28   M

In [30]:
# select all the candidates in their twenties only names and Ages
subset(x = Friends, subset = Ages > 20 & Ages < 30, select = c(Names, Ages))

  Names   Ages
1 Raju    24
3 Madhavi 26
4 Sita    28
5 Kapoor  29
8 Abdul   28

#### Sorting the dataframe with Order()

In [31]:
# The below line gets a sorted vector of indexes for Ages
sorted.friends <- order(Friends['Ages'])
# Using bracket notation we can get the sorted Dataframe
# sorted vector is used in the rows place 
Friends[sorted.friends,]

   Names   Ages Gender
6  John    18   M
9  Razak   19   M
1  Raju    24   M
3  Madhavi 26   F
4  Sita    28   F
8  Abdul   28   M
5  Kapoor  29   M
7  Mary    30   F
2  Latha   32   F
10 Sree    35   M

#### Selecting a single columns

In [36]:
# Selecting the column as a dataframe
Friends['Ages']

   Ages
1  24
2  32
3  26
4  28
5  29
6  18
7  30
8  28
9  19
10 35

In [35]:
# Selecting the column as a vector - Flat row like with double bracket notation
Friends[['Ages']] # Notice two brackets

 [1] 24 32 26 28 29 18 30 28 19 35

In [37]:
# Another way with $ notation
Friends$Ages

 [1] 24 32 26 28 29 18 30 28 19 35